ka2_2024/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/РасчетыСПоставщикамиПоСрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщикамиПоСрокам</name>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Долг</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПорядокЗачета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.РегистраторРасчетов</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.Сторно</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
      <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
      <types>DocumentRef.ВводОстатковСПодотчетниками</types>
      <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПлановогоПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСПоставщиками</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ka2_2024/src/Enums/ПоказателиАналитическихРегистров/ПоказателиАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиАналитическихРегистров</name>
  <enumValues>
    <name>Себестоимость</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Стоимость</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>СуммаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовДебета</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовКредита</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеДокумента</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеПлатежа</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходовБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДСДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаОплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПостоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПредоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаРегл</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеВРамкахЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеСверхЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплате</name>
  </enumValues>
  <enumValues>
    <name>СуммаВКорВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаУпрСНДС</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>КорКоличество</name>
  </enumValues>
  <enumValues>
    <name>РезервПодОбесценение</name>
  </enumValues>
  <enumValues>
    <name>СуммаРасходовНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>СуммаРасходовНаПродажуБезНДС</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыОперацийВзаимозачетаЗадолженности/ВидыОперацийВзаимозачетаЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаимозачетаЗадолженности</name>
  <enumValues>
    <name>УдалитьКлиента</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПоставщика</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМеждуКлиентами</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМеждуПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПоставщикаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Бартер</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПодарочнымСертификатом</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеОплатыЧерезКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеВозвратаОплатыЧерезКомиссионера</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/РегистраторРасчетов/РегистраторРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистраторРасчетов</name>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОплат</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПланПоставок</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОтгрузок</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоСрокам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоСрокам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПланОплат</registerRecords>
  <attributes>
    <name>УдалитьОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетовСПартнерами</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
</mdclass:Document>

ka2_2024/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++ НЕ УТ
#Область ОписаниеИсточника

// Определяет показатели регистра.
//
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ПредоплатаУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ПредоплатаРегл", "ВалютаРегл"));
    МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "Предоплата", "Валюта"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.12.77";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1d87b923-d170-44ae-9550-190d1f7da828");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполняет хозяйственную операцию для документа ""Взаимозачет задолженности"" с видом операции ""Перенос долга"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра	= "РегистрНакопления.РасчетыСПоставщикамиПоСрокам";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.РегистраторРасчетов";
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|	И ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
	|	И РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносДолга)
	|";
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций());
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам;
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Движения.ДокументРегистратор КАК Взаимозачет
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Движения
		|ГДЕ
		|	Движения.Регистратор В (&Регистраторы)
		|	И ВЫРАЗИТЬ(Движения.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Движения.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Движения
		|ГДЕ
		|	Движения.Регистратор В (&Регистраторы)
		|";
		Запрос.УстановитьПараметр("Регистраторы", ОбновляемыеДанные.ВыгрузитьКолонку("Регистратор"));
		Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций());
		Результаты = Запрос.ВыполнитьПакет();
		
		ПроблемныйРегистратор = Неопределено;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.ИсточникДанных = ОбновляемыеДанные;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();
			ДокументыВзаимозачетов = Результаты[0].Выгрузить().ВыгрузитьКолонку("Взаимозачет");
			ВыборкаПоРегистратору = Результаты[1].Выбрать();
			Пока ВыборкаПоРегистратору.Следующий() Цикл
				
				ПроблемныйРегистратор = ВыборкаПоРегистратору.Регистратор;
				
				Набор = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ВыборкаПоРегистратору.Регистратор);
				Набор.Прочитать();
				
				ЕстьИзменения = Ложь;
				Для Каждого Запись Из Набор Цикл
					Если Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносДолга
						И ДокументыВзаимозачетов.Найти(Запись.ДокументРегистратор) <> Неопределено Тогда
							Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносДолга;
							ЕстьИзменения = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьИзменения Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			Если ЗначениеЗаполнено(ПроблемныйРегистратор) Тогда
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось выполнить обработку данных регистра накопления Активы и пассивы, при обновлении по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы,
					ТекстСообщения);
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Функция ВидыОпераций()
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуОрганизациями);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
